// 백준 2193번: 이친수
// dp를 풀 때는 항상 int 범위 신경쓸 것! (특히 점화식 상 뒤로 갈수록 커지기만 하는 경우)

#include <bits/stdc++.h>
using namespace std;

long long pinary[90];

int main()
{
	int N;
	cin >> N;

	pinary[0] = 0;
	pinary[1] = 1;	// 1
	pinary[2] = 1;	// 10
	pinary[3] = 2;  // 100, 101
	//pinary[4] = 3;	// 1000, 1001, 1010
	//pinary[5] = 5;	// 10000, 10001, 10010, 10100, 10101
	//pinary[6] = 8;	// 100000, 100001, 100010, 100100, 100101, 101000, 101001, 101010
	//pinary[7] = 13;	// 1000000, 1000001, 1000010, 1000100, 1000101, 1001000, 1001001, 1001010, 1010000, 1010001, 1010010, 1010100, 1010101

	for (int i = 3; i <= N; i++)
	{
		pinary[i] = pinary[i - 2] * 2 + pinary[i-3];
	}

	cout << pinary[N];
	return 0;
}